Tekla Open API Reference for Tekla Structures 2025
HierarchicObject.RemoveObjects Method
 Removes associations to the given list of model objects. Fails if the hierarchical definition doesn't exist in the model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveObjects(
	ArrayList Objects
)
Public Function RemoveObjects (
	Objects As ArrayList
) As Boolean
Parameters
Objects
Type: System.Collections.ArrayList
The model objects.
Return Value
Type: Boolean
True if successful.
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace